{
  "backend/main.mo": "Main Motoko actor defining the workout scheduler backend with types for WorkoutScheduleEntry, MotivationalMessage, and UserProfile, plus CRUD APIs for schedules, motivational messages, and user profiles with role-based access control.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (Today's Workout, Schedule, Progress, motivational messages) to their source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of each frontend source file, serving as a quick reference for the purpose and contents of every frontend module.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, primary, card, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML entry point titled 'Daily Grind' that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with four routes (/, /today, /schedule, /progress), wraps them in ThemeProvider and AppLayout, and protects each route with AuthGuard.",
  "frontend/src/components/AppLayout.tsx": "App shell component rendering a sticky header with logo and desktop nav, a mobile bottom nav bar, a main content area, and a footer, with nav visibility tied to authentication state.",
  "frontend/src/components/AuthGuard.tsx": "Authentication gate that shows a loading spinner during initialization, a LoginScreen for unauthenticated users, a ProfileSetupModal for users without a profile, and renders children otherwise.",
  "frontend/src/components/LoginButton.tsx": "Button component handling Internet Identity login and logout, displaying contextual icons and a loading state, and clearing the React Query cache on logout.",
  "frontend/src/components/LoginScreen.tsx": "Renders the app's login landing page with a logo, feature highlights, and a login button using Internet Identity.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for new users to set a display name and toggle workout reminders, saving the profile via a mutation hook.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity auth context and provider component, managing AuthClient creation, login, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including workout schedules CRUD, motivational messages, and user profile read/write operations.",
  "frontend/src/index.css": "Global stylesheet importing fonts, Tailwind directives, and defining light/dark mode CSS custom properties along with utility and component classes for the fitness app theme.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Progress.tsx": "Progress page displaying weekly workout stats, streak count, and a day-by-day schedule overview computed from the user's workout schedule data.",
  "frontend/src/pages/Schedule.tsx": "A weekly workout schedule page that displays all 7 days as cards, allowing users to create, edit, and delete workout entries (name, details, time reminder) with inline forms and completion status badges.",
  "frontend/src/pages/TodaysWorkout.tsx": "A page showing the current day's scheduled workout with a motivational message banner, workout details, and a toggle button to mark the workout as completed or incomplete.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (supporting both standard and hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a dark fitness-themed design system with OKLCH color tokens, custom fonts (Inter, Barlow Condensed), glow shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata for 'Daily Grind', a workout reminder app, documenting existing features, architectural notes (three data tables, four screens), and build/fix request status."
}