{
  "backend/main.mo": "Main Motoko actor defining data types (WorkoutSchedule, UserProfile, Tier, etc.), persistent state maps, motivational message seeding, and backend functions for schedule CRUD, tier progression, and user profile management with access control.",
  "feature_evidence.json": "Feature evidence report listing two high-confidence features: fixing the save bug in Schedule.tsx and auditing mutation hooks in useQueries.ts to ensure correct WorkoutSchedule payload (including setRows) is passed to the backend.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, describing their purpose and key fixes applied across pages, hooks, components, and public assets.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes, covering background, foreground, primary, chart, and sidebar color tokens.",
  "frontend/index.html": "HTML entry point for the Daily Grind PWA, linking the manifest, setting PWA meta tags, and mounting the React app via the root div and main.tsx module script.",
  "frontend/public/manifest.json": "PWA web app manifest for Daily Grind defining standalone display mode, orange theme color, dark background, and a single 256x256 maskable app icon.",
  "frontend/public/sw.js": "Service Worker that schedules 4-hour periodic workout reminder push notifications with random motivational quotes, responds to START/STOP/TEST messages, and focuses or opens the app on notification click.",
  "frontend/src/App.tsx": "Root React app component that sets up TanStack Router with five routes (/, /schedule, /progress, /settings), wraps the app in ThemeProvider and QueryClientProvider, registers the service worker on mount, and renders a Toaster for notifications.",
  "frontend/src/components/AppLayout.tsx": "Defines the main app shell with a sticky header, desktop nav bar, and mobile bottom nav, showing navigation links only when the user is authenticated.",
  "frontend/src/components/AuthGuard.tsx": "Wraps protected routes to show a loading spinner, login screen, or profile setup modal depending on authentication and profile fetch state.",
  "frontend/src/components/LoginButton.tsx": "Renders a login/logout button that triggers Internet Identity authentication and clears the React Query cache on logout.",
  "frontend/src/components/LoginScreen.tsx": "Displays a centered landing screen with app branding, feature highlights, and a login button for unauthenticated users.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that collects a display name and notification preference to create a new user profile on first login.",
  "frontend/src/components/TierBadge.tsx": "Defines 22 ranked tiers with associated styles and exports a TierBadge component that renders a styled badge in compact or full variants.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage AuthClient lifecycle, identity persistence, and login/logout state.",
  "frontend/src/hooks/useNotifications.ts": "Custom React hook that manages browser push notification state, syncing enabled/disabled status with the backend user profile and exposing methods to enable, disable, and test notifications.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations including fetching/mutating workout schedules, user profiles, motivational messages, and tier progression.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, and defines CSS custom properties for light and dark mode color themes with fitness-oriented styling utilities.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/Progress.tsx": "Progress page that displays weekly workout stats, streak count, and a day-by-day completion grid derived from the user's workout schedules, along with their tier badge.",
  "frontend/src/pages/Schedule.tsx": "Schedule page that renders a per-day workout editor allowing users to create, edit, expand, and delete workout entries including set rows for each day of the week.",
  "frontend/src/pages/Settings.tsx": "Settings page that exposes tier progression evaluation controls and a push notification toggle, displaying current tier status and weekly completion progress.",
  "frontend/src/pages/TodaysWorkout.tsx": "React page that displays the current day's workout schedule entry, allows marking individual set rows and the full workout as complete with optimistic UI updates, and shows a refreshable motivational message.",
  "frontend/src/utils/notificationService.ts": "Utility module for managing browser push notifications via a service worker, providing functions to register the SW, request notification permission, and send control messages (start, stop, test notifications).",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both standard and hash-based routing, persisting them to sessionStorage, and cleaning sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a dark fitness-themed design system with OKLCH color tokens, custom fonts (Inter, Barlow Condensed), extended shadows, border radii, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state manifest for 'Daily Grind' describing current features, architectural notes (3 data tables, 4 screens, 22 tier progression), known issues (broken workout saving), and versioning metadata."
}