{
  "backend/main.mo": "Main Motoko actor defining the workout scheduling app's backend with types for workouts, user profiles, and a 22-tier progression system, plus CRUD APIs for workout schedules, motivational messages, and user profiles with role-based access control.",
  "feature_evidence.json": "Feature evidence report confirming that the notification interval in `frontend/public/sw.js` was changed from 6 hours to 4 hours, with high confidence and linked to test REQ-17.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of all frontend source files, describing each component, page, hook, and utility in the Daily Grind app.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, primary, chart, and sidebar tokens.",
  "frontend/index.html": "HTML entry point for the Daily Grind PWA, linking the manifest, setting PWA meta tags for iOS and Android, and mounting the React app via `src/main.tsx`.",
  "frontend/public/manifest.json": "PWA web app manifest for Daily Grind defining the app name, standalone display mode, theme/background colors, and a 256x256 icon for home screen installation.",
  "frontend/public/sw.js": "Service Worker that schedules periodic workout reminder notifications every 4 hours using setInterval, displays random motivational quotes, and handles START/STOP/TEST messages plus notification click events to focus or open the app window.",
  "frontend/src/App.tsx": "TanStack Router app setup with five routes (index, today, schedule, progress, settings) wrapped in a `RootLayout` component that applies ThemeProvider, AppLayout, and registers the service worker on mount.",
  "frontend/src/components/AppLayout.tsx": "App shell component rendering a sticky header with logo, desktop nav links, and login button, a mobile bottom nav bar, and a main content area with a branded footer.",
  "frontend/src/components/AuthGuard.tsx": "Wraps children with authentication and profile checks, showing a loading spinner, login screen, or profile setup modal as appropriate before rendering protected content.",
  "frontend/src/components/LoginButton.tsx": "Renders a login/logout button using Internet Identity, handling login, logout, and loading states with appropriate icons.",
  "frontend/src/components/LoginScreen.tsx": "Displays the app's landing/login page with branding, a feature list, and a login button for unauthenticated users.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time users to set a display name and notification preference, saving the profile via a mutation hook.",
  "frontend/src/components/TierBadge.tsx": "Defines 22 ranked tiers with associated styles and renders a styled badge component in compact or full variants based on a given tier.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor using the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity context and hook for managing authentication state, login, and logout using the DFINITY AuthClient.",
  "frontend/src/hooks/useNotifications.ts": "Manages browser notification permissions and scheduling, syncing enabled state with the backend user profile and exposing enable/disable/test actions.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including workout schedules (CRUD, mark complete), motivational messages, user profile, and tier system operations.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, and defines CSS custom properties for light/dark theme color tokens plus utility classes for glow shadows and success colors.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Progress.tsx": "Progress page displaying weekly workout stats (streak, completion percentage, day-by-day grid) derived from workout schedules, with tier badge and loading skeletons.",
  "frontend/src/pages/Schedule.tsx": "Schedule page showing a per-day workout card list with inline create/edit/delete forms and today highlighting, backed by workout schedule query hooks.",
  "frontend/src/pages/Settings.tsx": "Settings page for managing tier progression evaluation and browser push notification preferences, displaying current tier info and weekly completion progress.",
  "frontend/src/pages/TodaysWorkout.tsx": "React page that displays the current day's workout from the user's schedule, shows a motivational message banner, and provides a toggle button to mark the workout as completed.",
  "frontend/src/utils/notificationService.ts": "Utility module for managing browser push notifications via a service worker, including registration, permission requests, and sending messages to start/stop notification schedules or trigger test notifications.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routes, with helpers for persisting values to sessionStorage and cleaning sensitive params from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom design system with OKLCH-based color tokens, extended typography/border/shadow scales, accordion animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project state manifest describing the 'Daily Grind' workout reminder app's architecture, existing features, known issues, and versioning metadata for build planning."
}