{
  "kind": "build_request",
  "title": "Fix 'Not Found' grey screen on Today's Workout page after navigation",
  "projectName": "Daily Grind",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-37",
      "text": "Fix the routing configuration in `frontend/src/App.tsx` so that the root route (`/`) reliably renders the Today's Workout page on every visit — including when the user navigates away to another tab (Schedule, Progress, Settings) and then returns. The route must not fall through to a 'Not Found' state on re-visit.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "after I switch out of the Today section I am met with a grey screen that says not found"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to the Schedule, Progress, or Settings page and then clicking the Today nav link renders the Today's Workout page without any 'Not Found' screen.",
        "The Today's Workout page content is identical on first load and on return navigation.",
        "No grey screen or 'Not Found' text appears at any point during normal in-app navigation."
      ]
    },
    {
      "id": "REQ-38",
      "text": "Ensure that the Today's Workout page (`frontend/src/pages/TodaysWorkout.tsx`) always reflects the latest backend schedule data after the user returns from the Schedule page. The React Query schedule query used by TodaysWorkout must have a `staleTime` of 0 (or equivalent) so it refetches from the backend on every mount, and all schedule mutation hooks in `frontend/src/hooks/useQueries.ts` (create, update, delete, mark complete) must call `queryClient.invalidateQueries` with the exact same schedule query key used by TodaysWorkout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "updates after changes are made in the schedule",
          "looks the same as it does at the start and updates after changes are made in the schedule"
        ]
      },
      "acceptanceCriteria": [
        "After saving a new or edited workout entry on the Schedule page, navigating to the Today tab shows the updated workout name, details, and time reminder without requiring a manual page refresh.",
        "The schedule query key in TodaysWorkout.tsx matches exactly the key invalidated by all schedule mutation hooks in useQueries.ts.",
        "The schedule query on the Today page has staleTime set to 0 or a very short duration so stale data is never displayed on mount.",
        "Marking a workout as completed on the Today page is reflected immediately and persists after navigating away and back."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Do not change the backend schema or Motoko code.",
    "Preserve the existing dark fitness visual theme consistently across all pages."
  ],
  "nonGoals": [
    "Adding new features to the Today's Workout page beyond what is already implemented.",
    "Changing the Schedule page UI or editing workflow.",
    "Modifying backend API functions or data models."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}