{
  "kind": "build_request",
  "title": "Fix: Unable to save workout entries on Schedule page",
  "projectName": "Daily Grind",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-22",
      "text": "Diagnose and fix the bug in `frontend/src/pages/Schedule.tsx` that prevents users from saving workout entries. Inspect the save/submit handler, the mutation hook invocation (in `frontend/src/hooks/useQueries.ts`), and the data shape being passed to the backend (including the new `setRows` array field). Ensure the mutation correctly calls the backend `createScheduleEntry` or `updateScheduleEntry` function with a valid payload — including all required fields (`day`, `workoutName`, `workoutDetails`, `timeReminder`, `setRows`) — and that errors are surfaced to the user rather than silently swallowed. After fixing, the Save button must successfully persist the entry and trigger a schedule query invalidation/refetch.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "its not letting me save the workout"
        ]
      },
      "acceptanceCriteria": [
        "Clicking Save on a new or edited workout entry in the Schedule page successfully persists the entry to the backend without errors.",
        "After saving, the updated entry is visible in the schedule list (query is invalidated and refetched).",
        "If a backend error occurs, an error message is shown to the user.",
        "Entries with set rows (structured list) and entries without set rows (plain workoutDetails) both save correctly.",
        "The Save button does not remain in a loading/disabled state after a successful save."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Audit the mutation hook(s) in `frontend/src/hooks/useQueries.ts` responsible for creating and updating schedule entries. Ensure the argument types match the updated `WorkoutSchedule` backend type that includes the `setRows` field. Fix any type mismatches, missing fields, or incorrect argument serialization that could cause the Candid call to fail silently or throw.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "its not letting me save the workout"
        ]
      },
      "acceptanceCriteria": [
        "The `createScheduleEntry` and `updateScheduleEntry` mutation hooks correctly serialize all fields including `setRows` to match the backend Candid interface.",
        "No TypeScript type errors exist in the mutation hooks related to schedule entry payloads.",
        "A schedule entry with an empty `setRows` array saves successfully.",
        "A schedule entry with one or more set rows saves successfully and the rows are returned on subsequent fetch."
      ]
    }
  ],
  "constraints": [
    "Do not change the backend Motoko data model or API signatures unless a bug is found there that directly causes the save failure.",
    "Do not modify files listed in frontend.immutablePaths.",
    "Preserve backward compatibility for entries without set rows."
  ],
  "nonGoals": [
    "Adding new schedule features or UI changes beyond what is needed to fix the save bug.",
    "Changes to the Today's Workout page or Progress page.",
    "Modifying the notification system."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}