{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix: Unable to save workout entries on Schedule page",
  "requirements": [
    {
      "id": "REQ-22",
      "summary": "Fix the save handler in Schedule.tsx to properly persist workout entries with all required fields including setRows, and ensure errors are surfaced to the user",
      "acceptanceCriteria": [
        "Clicking Save on a new or edited workout entry in the Schedule page successfully persists the entry to the backend without errors.",
        "After saving, the updated entry is visible in the schedule list (query is invalidated and refetched).",
        "If a backend error occurs, an error message is shown to the user.",
        "Entries with set rows (structured list) and entries without set rows (plain workoutDetails) both save correctly.",
        "The Save button does not remain in a loading/disabled state after a successful save."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Schedule.tsx",
          "operation": "modify",
          "description": "Fix the handleSave function to correctly structure the workout entry payload with all required fields (day, workoutName, workoutDetails, timeReminder, setRows). Ensure the setRows array is properly formatted with id, description, and completed fields for each row. Add error handling to display mutation errors to the user via toast or error message. Verify the mutation is awaited and the form state is properly reset after successful save. Ensure proper query invalidation triggers after save to refresh the schedule list."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Audit and fix the createOrUpdateWorkoutSchedule mutation hook to ensure correct type serialization and field mapping for the setRows array",
      "acceptanceCriteria": [
        "The `createScheduleEntry` and `updateScheduleEntry` mutation hooks correctly serialize all fields including `setRows` to match the backend Candid interface.",
        "No TypeScript type errors exist in the mutation hooks related to schedule entry payloads.",
        "A schedule entry with an empty `setRows` array saves successfully.",
        "A schedule entry with one or more set rows saves successfully and the rows are returned on subsequent fetch."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Audit the useCreateOrUpdateWorkoutSchedule mutation hook to ensure the WorkoutSchedule payload matches the backend interface exactly. Verify that setRows is typed as Array<SetRow> with id (bigint), description (string), and completed (boolean) fields. Ensure dayOfWeek is correctly mapped to the DayOfWeek enum. Verify owner field is set to the caller's Principal. Add proper error handling and logging for mutation failures. Ensure the mutation properly invalidates the 'workoutSchedules' query key after successful save."
        }
      ]
    }
  ]
}