{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix 'Not Found' grey screen on Today's Workout page after navigation",
  "requirements": [
    {
      "id": "REQ-37",
      "summary": "Fix the routing configuration in App.tsx so that the root route (/) reliably renders the Today's Workout page on every visit, including when the user navigates away to another tab and returns, without falling through to a 'Not Found' state",
      "acceptanceCriteria": [
        "Navigating to the Schedule, Progress, or Settings page and then clicking the Today nav link renders the Today's Workout page without any 'Not Found' screen.",
        "The Today's Workout page content is identical on first load and on return navigation.",
        "No grey screen or 'Not Found' text appears at any point during normal in-app navigation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Review and fix the root route configuration to ensure it always renders the TodaysWorkout page component on every visit to `/`, including after navigating away and returning. Verify that the route path, component assignment, and routing library setup are correctly configured to prevent fallthrough to a 'Not Found' handler. Ensure the route is registered before any catch-all or 404 routes."
        }
      ]
    },
    {
      "id": "REQ-38",
      "summary": "Ensure that the Today's Workout page always reflects the latest backend schedule data after the user returns from the Schedule page by setting staleTime to 0 on the schedule query and ensuring all schedule mutation hooks invalidate the same query key",
      "acceptanceCriteria": [
        "After saving a new or edited workout entry on the Schedule page, navigating to the Today tab shows the updated workout name, details, and time reminder without requiring a manual page refresh.",
        "The schedule query key in TodaysWorkout.tsx matches exactly the key invalidated by all schedule mutation hooks in useQueries.ts.",
        "The schedule query on the Today page has staleTime set to 0 or a very short duration so stale data is never displayed on mount.",
        "Marking a workout as completed on the Today page is reflected immediately and persists after navigating away and back."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/TodaysWorkout.tsx",
          "operation": "modify",
          "description": "Review the React Query configuration for the workout schedule query used by TodaysWorkout. Ensure it fetches the latest schedule data on every mount by setting staleTime to 0. Verify that the query key used here exactly matches the key invalidated by mutation hooks in useQueries.ts. If the current implementation uses a different query or no explicit staleTime, update it to guarantee fresh data on navigation."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review all schedule mutation hooks (create, update, delete, mark complete) and ensure each one calls queryClient.invalidateQueries with the exact same schedule query key used by TodaysWorkout.tsx. Verify that the query key structure is consistent across all hooks. If any mutation hook is missing the invalidation call or uses a different key, update it to ensure TodaysWorkout always refetches after mutations."
        }
      ]
    }
  ]
}